{
  "recipes": [
    {
      "id": 1,
      "name": "Chicken Fajitas",
      "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/02/How-to-Make-Chicken-Fajitas-1-2.jpg",
      "ingredients": [
        "3 boneless skinless chicken breasts",
        "1 onion, thinly sliced",
        "3 bell peppers , thinly sliced",
        "2 tablespoons olive oil",
        "1/2 lime",
        "1/2 tablespoon chili powder",
        "1/2 tablespoon ground cumin",
        "1 teaspoon garlic powder",
        "1/2 teaspoon paprika",
        "1/2 teaspoon oregano",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper"
      ],
      "directions": "1) Add the fajitas seasoning ingredients to a small mixing bowl and stir together. 2) Generously sprinkle the fajita seasoning on both sides of the chicken and use your fingers to press it into the chicken. 3) Heat the oil in a large skillet over medium heat. Sear the chicken breasts for about 7-8 minutes on each side. 4) While your chicken is cooking, cut the bell peppers and onion into thin slices. 5) Once the chicken has finished cooking, remove it to a plate and let it rest for a couple of minutes. Add the bell peppers and onion to the same skillet over medium heat and saute for 4-5 minutes, stirring frequently. 6) When the bell peppers are just about done sauteing, slice the chicken breasts into strips. 7) Add the chicken back into the skillet, add a squeeze of fresh lime juice and stir everything together. 8) Serve immediately with tortillas and extra toppings such as sour cream, pico de gallo and guacamole.",
      "time": 26,
      "cuisine": "Mexican"
    },
    {
      "id": 2,
      "name": "Shrimp Scampi",
      "image": "https://www.allrecipes.com/thmb/M_JD8gcZbIWk_TL0yBthlQ4zOs8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/229960-Shrimp-Scampi-with-Pasta-mfs-048-70ffd08f7c4549ffb5367868b5fb7365.jpg",
      "ingredients": [
        "1 (16 ounce) package linguine pasta",
        "4 tablespoons butter",
        "4 tablespoons extra-virgin olive oil",
        "2 shallots, finely diced",
        "2 cloves garlic, minced",
        "1 pinch red pepper flakes (Optional)",
        "1 pound shrimp, peeled and deveined",
        "1 pinch kosher salt and freshly ground pepper",
        "1/2 cup dry white wine",
        "1 lemon, juiced",
        "1/4 cup finely chopped fresh parsley leaves",
        "1 teaspoon extra-virgin olive oil, or to taste"
      ],
      "directions": "1) Gather ingredients. 2) Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain. 3) Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. 4) Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm. 5) Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. 6) Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.",
      "time": 15,
      "cuisine": "Italian"
    },
    {
      "id": 3,
      "name": "Teriyaki Chicken Casserole",
      "image": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
      "ingredients": [
        "3/4 cup soy sauce",
        "1/2 cup water",
        "1/4 cup brown sugar",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon minced garlic",
        "4 tablespoon cornstarch",
        "2 chicken breasts",
        "1 (12oz) package stir-fry vegetables",
        "3 cups brown rice"
      ],
      "directions": "1) Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray. 2) Combine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling. 3) Meanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat. 4) Place the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks. 5) *Meanwhile, steam or cook the vegetables according to package directions. 6) Add the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
      "cuisine": "Japanese",
      "time" : 65
    },
    {
      "id": 4,
      "name": "Tonkatsu pork",
      "image": "https://www.themealdb.com/images/media/meals/lwsnkl1604181187.jpg",
      "ingredients": [
        "Pork Chops",
        "Flour",
        "Eggs",
        "Breadcrumbs",
        "Vegetable Oil",
        "Tomato Ketchup",
        "Worcestershire Sauce",
        "Oyster Sauce",
        "Caster Sugar"
      ],
      "directions": "STEP 1\r\nRemove the large piece of fat on the edge of each pork loin, then bash each of the loins between two pieces of baking parchment until around 1cm in thickness – you can do this using a meat tenderiser or a rolling pin. Once bashed, use your hands to reshape the meat to its original shape and thickness – this step will ensure the meat is as succulent as possible.\r\n\r\nSTEP 2\r\nPut the flour, eggs and panko breadcrumbs into three separate wide-rimmed bowls. Season the meat, then dip first in the flour, followed by the eggs, then the breadcrumbs.\r\n\r\nSTEP 3\r\nIn a large frying or sauté pan, add enough oil to come 2cm up the side of the pan. Heat the oil to 180C – if you don’t have a thermometer, drop a bit of panko into the oil and if it sinks a little then starts to fry, the oil is ready. Add two pork chops and cook for 1 min 30 secs on each side, then remove and leave to rest on a wire rack for 5 mins. Repeat with the remaining pork chops.\r\n\r\nSTEP 4\r\nWhile the pork is resting, make the sauce by whisking the ingredients together, adding a splash of water if it’s particularly thick. Slice the tonkatsu and serve drizzled with the sauce.",
      "cuisine": "Japanese",
      "time" : 30
    }
  ]
}