{
  "recipes": [
    {
      "id": 1,
      "name": "Chicken Fajitas",
      "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/02/How-to-Make-Chicken-Fajitas-1-2.jpg",
      "ingredients": [
        "3 boneless skinless chicken breasts",
        "1 onion, thinly sliced",
        "3 bell peppers , thinly sliced",
        "2 tablespoons olive oil",
        "1/2 lime",
        "1/2 tablespoon chili powder",
        "1/2 tablespoon ground cumin",
        "1 teaspoon garlic powder",
        "1/2 teaspoon paprika",
        "1/2 teaspoon oregano",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper"
      ],
      "directions": "1) Add the fajitas seasoning ingredients to a small mixing bowl and stir together. 2) Generously sprinkle the fajita seasoning on both sides of the chicken and use your fingers to press it into the chicken. 3) Heat the oil in a large skillet over medium heat. Sear the chicken breasts for about 7-8 minutes on each side. 4) While your chicken is cooking, cut the bell peppers and onion into thin slices. 5) Once the chicken has finished cooking, remove it to a plate and let it rest for a couple of minutes. Add the bell peppers and onion to the same skillet over medium heat and saute for 4-5 minutes, stirring frequently. 6) When the bell peppers are just about done sauteing, slice the chicken breasts into strips. 7) Add the chicken back into the skillet, add a squeeze of fresh lime juice and stir everything together. 8) Serve immediately with tortillas and extra toppings such as sour cream, pico de gallo and guacamole.",
      "time": 26,
      "cuisine": "Mexican"
    },
    {
      "id": 2,
      "name": "Shrimp Scampi",
      "image": "https://www.allrecipes.com/thmb/M_JD8gcZbIWk_TL0yBthlQ4zOs8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/229960-Shrimp-Scampi-with-Pasta-mfs-048-70ffd08f7c4549ffb5367868b5fb7365.jpg",
      "ingredients": [
        "1 (16 ounce) package linguine pasta",
        "4 tablespoons butter",
        "4 tablespoons extra-virgin olive oil",
        "2 shallots, finely diced",
        "2 cloves garlic, minced",
        "1 pinch red pepper flakes (Optional)",
        "1 pound shrimp, peeled and deveined",
        "1 pinch kosher salt and freshly ground pepper",
        "1/2 cup dry white wine",
        "1 lemon, juiced",
        "1/4 cup finely chopped fresh parsley leaves",
        "1 teaspoon extra-virgin olive oil, or to taste"
      ],
      "directions": "1) Gather ingredients. 2) Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain. 3) Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. 4) Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm. 5) Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. 6) Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.",
      "time": 15,
      "cuisine": "Italian"
    },
    {
      "id": 3,
      "name": "Teriyaki Chicken Casserole",
      "image": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
      "ingredients": [
        "3/4 cup soy sauce",
        "1/2 cup water",
        "1/4 cup brown sugar",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon minced garlic",
        "4 tablespoon cornstarch",
        "2 chicken breasts",
        "1 (12oz) package stir-fry vegetables",
        "3 cups brown rice"
      ],
      "directions": "1) Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray. 2) Combine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling. 3) Meanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat. 4) Place the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks. 5) *Meanwhile, steam or cook the vegetables according to package directions. 6) Add the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
      "cuisine": "Japanese",
      "time" : 65
    },
    {
      "id": 4,
      "name": "Beef Lo Mein",
      "image": "https://www.themealdb.com/images/media/meals/1529444830.jpg",
      "ingredients": [
      "1/2 lb Beef",
      "pinch Salt",
      "pinch Pepper",
      "2 tsp Sesame Seed Oil",
      "1/2 Egg",
      "3 tbs Starch",
      "5 tbs Oil",
      "1/4 lb Noodles",
      "1/2 cup Onion",
      "1 tsp Minced Garlic",
      "1 tsp Ginger",
      "1 cup Bean Sprouts",
      "1 cup Mushrooms",
      "1 cup Water",
      "1 tbs Oyster Sauce",
      "1 tsp Sugar",
      "1 tsp Soy Sauce"
      ],
      "directions": "1) - MARINATING THE BEEF In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.  2) - BOILING THE THE NOODLES In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.  3) - STIR FRY Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked. Set the cooked beef aside In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water. Add the noodles to wok To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce. Next add the beef to wok and stir-fry",
      "cuisine": "Chinese",
      "time" : 30
    },
    {
      "id": 5,
      "name": "Chocolate Raspberry Brownies",
      "image": "https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg",
      "ingredients": [
        "200g Dark Chocolate",
        "100g Milk Chocolate",
        "250g Salted Butter",
        "400g Light Brown Soft Sugar",
        "4 large Eggs",
        "140g Plain Flour",
        "50g Cocoa",
        "200g Raspberries"
      ],
      "directions": "1) Heat oven to 180C/160C fan/gas 4. Line a 20 x 30cm baking tray tin with baking parchment. 2) Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon. Remove from the heat. 3) Stir the eggs, one by one, into the melted chocolate mixture. 4) Sieve over the flour and cocoa, and stir in. 5) Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries. 6) Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more. Cool before slicing into squares. Store in an airtight container for up to 3 days.",
      "cuisine": "American",
      "time" : 40
    },
    {
      "id": 6,
      "name": "Spicy Arrabiata Penne",
      "image": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg",
      "ingredients": [
      "1 pound penne rigate",
      "1/4 cup olive oil",
      "3 cloves garlic",
      "1 tin chopped tomatoes",
      "1/2 teaspoon red chile flakes",
      "1/2 teaspoon italian seasoning",
      "6 leaves basil",
      "spinkling Parmigiano-Reggiano"
      ],
      "directions": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.In a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil. Drain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
      "cuisine": "Italian",
      "time" : 25
    },
    {
      "id": 7,
      "name": "Pizza Express Margherita",
      "image": "https://www.themealdb.com/images/media/meals/x0lk931587671540.jpg",
      "ingredients": [
        "150ml Water",
        "1 tsp Sugar",
        "15g Yeast",
        "225g Plain Flour",
        "1 1/2 tsp Salt",
        "Drizzle Olive Oil",
        "80g Passata",
        "70g Mozzarella",
        "Peeled and Sliced Oregano",
        "Leaves Basil",
       "Pinch Black Pepper"
      ],
      "directions": "1 Preheat the oven to 230°C.2 Add the sugar and crumble the fresh yeast into warm water.3 Allow the mixture to stand for 10 – 15 minutes in a warm place (we find a windowsill on a sunny day works best) until froth develops on the surface. 4 Sift the flour and salt into a large mixing bowl, make a well in the middle and pour in the yeast mixture and olive oil.5 Lightly flour your hands, and slowly mix the ingredients together until they bind.6 Generously dust your surface with flour.7 Throw down the dough and begin kneading for 10 minutes until smooth, silky and soft.8 Place in a lightly oiled, non-stick baking tray (we use a round one, but any shape will do!)9 Spread the passata on top making sure you go to the edge.10 Evenly place the mozzarella (or other cheese) on top, season with the oregano and black pepper, then drizzle with a little olive oil.11 Cook in the oven for 10 – 12 minutes until the cheese slightly colours.12 When ready, place the basil leaf on top and tuck in!",
      "cuisine": "Italian",
      "time" : 25
    },
    {
      "id": 8,
      "name": "Szechuan Beef",
      "image": "https://www.themealdb.com/images/media/meals/1529443236.jpg",
      "ingredients": [
      "1/2 lb Beef",
      "1/2 tsp Salt",
      "1 tsp Sesame Seed Oil",
      "1 pinch Pepper",
      "1 Egg White",
      "3 tbs Starch",
      "4 tbs Oil",
      "1 tsp Ginger",
      "1 tsp Garlic",
      "3/4 cup Onion",
      "1/2 cup Carrots",
      "3/4 cup Green Pepper",
      "1 cup Celery",
      "1 cup Mushrooms",
      "1 tbs Cooking wine",
      "1 cup Water",
      "1 tbs Oyster Sauce",
      "1/2 tsp Hotsauce",
      "1 tsp Sugar",
      "1 tbs Soy Sauce"
      ],
      "directions": "STEP 1 - MARINATING THE BEEF In a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil. STEP 2 - STIR FRY First Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown. Set the beef aside In a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds. Next add all of the vegetables and then add sherry cooking wine and 1 cup of water. To make the sauce add oyster sauce, hot pepper sauce, and sugar. add the cooked beef and 1 spoon of soy sauce To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
      "cuisine": "Chinese",
      "time" : 30
    }, 
    {
      "id": 9,
      "name": "Budino Di Ricotta",
      "image": "https://www.themealdb.com/images/media/meals/1549542877.jpg",
      "ingredients": [
        "500g Ricotta",
        "4 large Eggs",
        "3 tbs Flour",
        "250g Sugar",
        "1 tsp Cinnamon",
        "Grated Zest of 2 Lemons",
        "5 tbs Dark Rum",
        "sprinking Icing Sugar"
      ],
      "directions": "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm. Serve hot or cold dusted with icing sugar.",
      "cuisine": "Italian",
      "time" : 40
    },
    {
      "id": 10,
      "name": "Skillet Apple Pork Chops with Roasted Sweet Potatoes & Zucchini",
      "image": "https://www.themealdb.com/images/media/meals/h3ijwo1581013377.jpg",
      "ingredients": [
      "2 Potatoes",
      "1 Apples",
      "2 cloves Garlic",
      "1 Lemon",
      "2 lb Pork",
      "1 lrg Zucchini",
      "1 cu[ Chicken Stock",
      "1 tbsp Vegetable Oil",
      "1 1/2 tsp Sugar",
      "2 tbsp Butter"
      ],
      "directions": "Serves 2.  1.  Adjust racks to top and middle positions and preheat oven to 450 degrees. Wash and dry all produce. Dice sweet potatoes into 1/2-inch pieces. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast on top rack for 12 minutes (we'll roast the zucchini then).  2.  Meanwhile, halve and core apple; thinly slice into half-moons. Peel and finely chop garlic. Quarter lemon. Trim and halve zucchini lengthwise; cut crosswise into 1/2-inch-thick half-moons. Toss on a second baking sheet with a drizzle of oil and a pinch of salt and pepper. Set aside.  3.  Pat pork dry with paper towels and season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add pork and cook until browned and cooked through, 4-5 minutes per side. Turn off heat; transfer to a plate.  4.  Once sweet potatoes have roasted 12 minutes, transfer baking sheet with zucchini to middle rack and continue roasting until both veggies are browned and softened, 12-15 minutes more.  5.  Meanwhile, melt 1 TBSP butter (2 TBSP for 4 servings) in pan used for pork over medium-high heat. Add apple and season with salt and pepper. Cook, scraping up any browned bits from bottom of pan, until apple is slightly softened, 2-3 minutes. Add garlic; cook until fragrant, 30 seconds. Add 1/z cup water (3/4 cup for 4), stock concentrate, and 11/2 tsp sugar (3 tsp for 4). Cook, stirring, until sauce has thickened and apple is very tender, 3-5 minutes. Season with salt and pepper.  6.  Remove pan with apple from heat; stir in 1 TBSP butter (2 TBSP for 4 servings) and a squeeze of lemon juice. Divide pork, zucchini, and sweet potatoes between plates. Top pork with glazed apple sauce. Top zucchini with a squeeze of lemon juice. ",
      "cuisine": "American",
      "time" : 40
    },
    {
      "id": 11,
      "name": "Thai Green Curry",
      "image": "https://www.themealdb.com/images/media/meals/sstssx1487349585.jpg",
      "ingredients": [
      "225g new potatoes",
      "100g green beans",
      "1 tbsp sunflower oil",
      "1 clove garlic",
      "4 tsp Thai green curry paste",
      "400ml coconut milk",
      "2 tsp Thai fish sauce",
      "1 tsp Sugar",
      "450g boneless Chicken",
      "2 fresh kaffir leaves lime",
      "handfull of basil",
      "2cup Boiled Rice"
      ],
      "directions": "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a further 3 minutes, by which time both should be just tender but not too soft. Drain and put to one side. In a wok or large frying pan, heat the oil until very hot, then drop in the garlic and cook until golden, this should take only a few seconds. Don’t let it go very dark or it will spoil the taste. Spoon in the curry paste and stir it around for a few seconds to begin to cook the spices and release all the flavours. Next, pour in the coconut milk and let it come to a bubble. Stir in the fish sauce and sugar, then the pieces of chicken. Turn the heat down to a simmer and cook, covered, for about 8 minutes until the chicken is cooked. Tip in the potatoes and beans and let them warm through in the hot coconut milk, then add a lovely citrussy flavour by stirring in the shredded lime leaves (or lime zest). The basil leaves go in next, but only leave them briefly on the heat or they will quickly lose their brightness. Scatter with the lime garnish and serve immediately with boiled rice.",
      "cuisine": "Thai",
      "time" : 15
    },
    {
      "id": 12,
      "name": "Big Mac",
      "image": "https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg",
      "ingredients": [
        "400g Minced Beef",
        "2 tbs Olive Oil",
        "2 Sesame Seed Burger Buns",
        "1/4 Chopped Onion",
       " Chopped Iceberg Lettuce",
        "2 slices Cheese",
        "2 large Dill Pickles",
        "1 cup Mayonnaise",
        "2 tsp White Wine Vinegar",
        "Pinch Pepper",
        "2 tsp Mustard",
        "1 1/2 tsp Onion Salt",
        "1 1/2 tsp Garlic Powder",
        "1/2 tsp Paprika"
      ],
      "directions": "For the Big Mac sauce, combine all the ingredients in a bowl, season with salt and chill until ready to use. 2. To make the patties, season the mince with salt and pepper and form into 4 balls using about 1/3 cup mince each. Place each onto a square of baking paper and flatten to form into four x 15cm circles. Heat oil in a large frypan over high heat. In 2 batches, cook beef patties for 1-2 minutes each side until lightly charred and cooked through. Remove from heat and keep warm. Repeat with remaining two patties. 3. Carefully slice each burger bun into three acrossways, then lightly toast. 4. To assemble the burgers, spread a little Big Mac sauce over the bottom base. Top with some chopped onion, shredded lettuce, slice of cheese, beef patty and some pickle slices. Top with the middle bun layer, and spread with more Big Mac sauce, onion, lettuce, pickles, beef patty and then finish with more sauce. Top with burger lid to serve. 5. After waiting half an hour for your food to settle, go for a jog.",
      "cuisine": "American",
      "time" : 15
    },
    {
      "id": 13,
      "name": "Peanut Butter Cookies",
      "image": "https://www.themealdb.com/images/media/meals/1544384070.jpg",
      "ingredients": [
      "1 Cup Peanut Butter",
      "1/2 Cup Sugar",
      "1 Egg"
      ],
      "directions": "Preheat oven to 350ºF (180ºC). In a large bowl, mix together the peanut butter, sugar, and egg. Scoop out a spoonful of dough and roll it into a ball. Place the cookie balls onto a nonstick baking sheet. For extra decoration and to make them cook more evenly, flatten the cookie balls by pressing a fork down on top of them, then press it down again at a 90º angle to make a criss-cross pattern. Bake for 8-10 minutes or until the bottom of the cookies are golden brown. Remove from baking sheet and cool. Enjoy!",
      "cuisine": "American",
      "time" : 15
    },
    {
      "id": 14,
      "name": "Moussaka",
      "image": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg",
      "ingredients": [
        "500g Beef",
        "1 large Aubergine",
        "150g Greek Yogurt",
        "1 beaten Egg",
        "3tbs Parmesan",
        "400g Tomato",
        "4 tbs Tomato Puree",
        "350g Potatoes"

      ],
      "directions": "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning. Stir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden.",
      "cuisine": "Greek",
      "time" : 15
    },
    {
      "id": 15,
      "name": "Honey Yogurt Cheesecake",
      "image": "https://www.themealdb.com/images/media/meals/y2irzl1585563479.jpg",
      "ingredients": [
      "100g Digestive Biscuits",
      "85g Almonds",
      "85g Butter",
      "250ml Greek Yogurt",
      "750g Mascarpone",
      "2 Eggs",
      "Zest of 1 Lemon",
      "Zest of 1 Orange",
      "250 ml Honey",
      "To Serve, Fruit Mix"
      ],
      "directions": "Heat oven to 160C/140C fan/gas 3. Crush the biscuits and most of the almonds inside a plastic food bag using a rolling pin. Mix with the butter, then press into the bottom of a deep, oval, 23cm dish (or something similar in size – a roasting tin, baking dish or cake tin will work). Bake for 10 mins until crisp. Stir or mash together the yogurt and mascarpone, then whisk in the eggs, one at a time. Stir in the lemon and orange zests, then stir in most of the honey, reserving about 3 tbsp. Spread over the biscuit base, cover loosely with foil and cook for 1 hr. Remove the foil and cook for 15 mins more until lightly golden and the top is firm with just the slightest wobble in the middle. Leave to cool. Can be kept in the fridge for up to 2 days. To serve, scatter with almonds, drizzle over the remaining honey, and hand around fresh fruit to go with it.",
      "cuisine": "Greek",
      "time" : 25
    }

  ]
}